DELETE
FROM user_role;
DELETE
FROM users;
DELETE
FROM meals;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin'),
       ('Guest', 'guest@gmail.com', 'guest');

INSERT INTO meals (user_id, date_time, description, calories)
VALUES (100000, '2020-01-30 10:00', 'Пользовательский Завтрак', 500),
       (100000, '2020-01-30 13:00', 'Пользовательский Обед', 1000),
       (100000, '2020-01-30 20:00', 'Пользовательский Ужин', 500),
       (100000, '2020-01-31 00:00', 'Пользовательский Еда на граничное значение', 100),
       (100000, '2020-01-31 10:00', 'Пользовательский Завтрак', 1000),
       (100000, '2020-01-31 13:00', 'Пользовательский Обед', 500),
       (100000, '2020-01-31 20:00', 'Пользовательский Ужин', 410),
       (100001, '2024-01-30 10:01', 'Админский Завтрак', 501),
       (100001, '2024-01-30 13:01', 'Админский Обед', 1001),
       (100001, '2024-01-30 20:01', 'Админский Ужин', 501),
       (100001, '2024-01-31 00:01', 'Админский Еда на граничное значение', 101),
       (100001, '2024-01-31 10:01', 'Админский Завтрак', 1001),
       (100001, '2024-01-31 13:01', 'Админский Обед', 501),
       (100001, '2024-01-31 20:01', 'Админский Ужин', 411)
;

INSERT INTO user_role (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);
